Функция ЭтоИзмененныеМетаданные(ИдентификаторМетаданных) Экспорт
     УстановитьПривилегированныйРежим(Истина);
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1 
		|	Истина 
		|ИЗ
		|	Справочник.Изм_ТехническиеПроекты.ИзмененныеМетаданные КАК Изм_ТехническиеПроектыИзмененныеМетаданные
		|ГДЕ
		|	Изм_ТехническиеПроектыИзмененныеМетаданные.ОбъектМетаданных = &ОбъектМетаданных";
	
	Запрос.УстановитьПараметр("ОбъектМетаданных", ИдентификаторМетаданных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
КонецФункции // ()
