#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ФайлыДляГрафа = Изм_БиблиотекаG6Клиент.НовыеФайлы(УникальныйИдентификатор);
	ПодготовитьФайлСДанными();
	ГрафСвязей = ФайлыДляГрафа.ИндексныйФайл;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УстановитьПиктограммыСсылок(); 
	УстановитьРодителяМетаданных();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПолноеОписание = ТекущийОбъект.ПолноеОписание.Получить();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ПолноеОписание = Новый ХранилищеЗначения(ПолноеОписание);
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоммитыТехПроекта.Параметры.УстановитьЗначениеПараметра("ТехПроект", Объект.Ссылка);    
	Связи.Параметры.УстановитьЗначениеПараметра("ТехПроект", Объект.Ссылка);
	УстановитьПиктограммыСсылок(); 
	ПодсчитатьКоличествоКоммитов();
	ПодсчитатьКоличествоСвязей();
	УстановитьРодителяМетаданных();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Изм_БиблиотекаG6Клиент.УдалитьСлужебныеФайлы(УникальныйИдентификатор);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИзмененныеМетаданные
&НаКлиенте
Процедура ИзмененныеМетаданныеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Для каждого ВыбраннаяПозиция Из ВыбранноеЗначение Цикл
		НоваяСтрока = Объект.ИзмененныеМетаданные.Добавить();
		НоваяСтрока.ОбъектМетаданных = ВыбраннаяПозиция;
	КонецЦикла;
	УстановитьРодителяМетаданных();
КонецПроцедуры

&НаКлиенте
Процедура ИзмененныеМетаданныеПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УстановитьРодителяМетаданных();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСсылки
&НаКлиенте
Процедура СсылкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СсылкиОписание" Тогда    
		СтандартнаяОбработка = Ложь;
		СтрокаСДанными = Объект.Ссылки.НайтиПоИдентификатору(ВыбраннаяСтрока);
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(СтрокаСДанными.АдресСсылки);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СсылкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавлениеСсылкиЗавершение", ЭтотОбъект);  
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипСсылки", "");
	ПараметрыФормы.Вставить("АдресСсылки", "");
	ПараметрыФормы.Вставить("Описание", "");
	ОткрытьФорму("ОбщаяФорма.Изм_ФормаРедактированияСсылки", ПараметрыФормы, ЭтотОбъект, , , , 
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СсылкиПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактированиеСсылкиЗавершение", ЭтотОбъект, ТекущиеДанные);  
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипСсылки", ТекущиеДанные.ТипСсылки);
	ПараметрыФормы.Вставить("АдресСсылки", ТекущиеДанные.АдресСсылки);
	ПараметрыФормы.Вставить("Описание", ТекущиеДанные.Описание);
	ОткрытьФорму("ОбщаяФорма.Изм_ФормаРедактированияСсылки", ПараметрыФормы, ЭтотОбъект, , , , 
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСвязи
&НаКлиенте
Процедура СвязиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавлениеСвязиЗавершение", ЭтотОбъект);
	ЭлементыОтбора = Новый Структура("Источник", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("РегистрСведений.Изм_СвязиПроектов.Форма.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект, , , , 
		ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура СвязиПослеУдаления(Элемент)
	ПодсчитатьКоличествоСвязей();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Асинх Процедура Подбор(Команда)
	СписокТиповМетаданных = Новый СписокЗначений;
	СписокТиповМетаданных.Добавить("ИдентификаторыОбъектовМетаданных", "Идентификаторы объектов метаданных");
	СписокТиповМетаданных.Добавить("ИдентификаторыОбъектовРасширений", "Идентификаторы объектов расширений");

	ВыбранныйЭлемент = Ждать СписокТиповМетаданных.ВыбратьЭлементАсинх("Выберите тип метаданных");
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ШаблонИмяФормы = "Справочник.%1.ФормаСписка";
	ИмяФормыПодбора = СтрШаблон(ШаблонИмяФормы, ВыбранныйЭлемент.Значение);
	
	ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор, РежимВыбора", Ложь, Истина, Истина);
	ОткрытьФорму(ИмяФормыПодбора, ПараметрыФормы, Элементы.ИзмененныеМетаданные);
КонецПроцедуры

&НаКлиенте
Процедура ИзмененияМетаданных(Команда)
	ТекущиеДанные = Элементы.ИзмененныеМетаданные.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ПараметрыОткрытия = Новый Структура("Ссылка", ТекущиеДанные.ОбъектМетаданных);
    ОткрытьФорму("ОбщаяФорма.Изм_ИзмененияМетаданных", ПараметрыОткрытия, , УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКДанным(Команда)
	ТекущиеДанные = Элементы.ИзмененныеМетаданные.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяФормыМетаданных = ИмяФормыМетаданных(ТекущиеДанные.ОбъектМетаданных); 
	Если ИмяФормыМетаданных = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОткрытьФорму(ИмяФормыМетаданных);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ИмяФормыМетаданных(ИдентификаторМетаданных)
	ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИдентификаторМетаданных);
	Имя = ОбъектМетаданных.Имя;
	ШаблонФормы = "%1.%2.%3";
	Если ОбщегоНазначения.ЭтоКонстанта(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "Константа", Имя, "ФормаКонстант"); 
	ИначеЕсли ОбщегоНазначения.ЭтоДокумент(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "Документ", Имя, "ФормаСписка"); 
	ИначеЕсли ОбщегоНазначения.ЭтоЖурналДокументов(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "ЖурналДокументов", Имя, "ФормаСписка");	
	ИначеЕсли ЭтоОтчет(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "Отчет", Имя, "Форма");
	ИначеЕсли ЭтоОбработка(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "Обработка", Имя, "Форма");		
	ИначеЕсли  ОбщегоНазначения.ЭтоСправочник(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "Справочник", Имя, "ФормаСписка"); 	
	ИначеЕсли  ОбщегоНазначения.ЭтоПланВидовХарактеристик(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "ПланВидовХарактеристик", Имя, "ФормаСписка"); 		
	ИначеЕсли  ОбщегоНазначения.ЭтоРегистрСведений(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "РегистрСведений", Имя, "ФормаСписка");
	ИначеЕсли  ОбщегоНазначения.ЭтоРегистрНакопления(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "РегистрНакопления", Имя, "ФормаСписка");		
	ИначеЕсли  ОбщегоНазначения.ЭтоРегистрБухгалтерии(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "РегистрБухгалтерии", Имя, "ФормаСписка");	
	ИначеЕсли  ОбщегоНазначения.ЭтоПланСчетов(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "ПланСчетов", Имя, "ФормаСписка");
	ИначеЕсли  ОбщегоНазначения.ЭтоБизнесПроцесс(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "БизнесПроцесс", Имя, "ФормаСписка");	
	ИначеЕсли  ОбщегоНазначения.ЭтоБизнесПроцесс(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "БизнесПроцесс", Имя, "ФормаСписка");	
	ИначеЕсли  ОбщегоНазначения.ЭтоЗадача(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "Задача", Имя, "ФормаСписка");	
	ИначеЕсли  ОбщегоНазначения.ЭтоПланОбмена(ОбъектМетаданных) Тогда
		Результат = СтрШаблон(ШаблонФормы, "ПланОбмена", Имя, "ФормаСписка");		
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ЭтоОтчет(ОбъектМетаданных)
	Возврат Метаданные.Отчеты.Содержит(ОбъектМетаданных);
КонецФункции

&НаСервере
Функция ЭтоОбработка(ОбъектМетаданных)
	Возврат Метаданные.Обработки.Содержит(ОбъектМетаданных);
КонецФункции

&НаСервере
Процедура УстановитьПиктограммыСсылок()
	ТипыСсылок = Объект.Ссылки.Выгрузить(, "ТипСсылки").ВыгрузитьКолонку("ТипСсылки");
	ТипыСсылок = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТипыСсылок);
	АдресаПиктограмм = Новый Соответствие;
	Для каждого ТипСсылок Из ТипыСсылок Цикл
		АдресаПиктограмм.Вставить(ТипСсылок, ПолучитьНавигационнуюСсылку(ТипСсылок, "Пиктограмма"));
	КонецЦикла; 
	Для каждого Строка Из Объект.Ссылки Цикл
		Строка.АдресПиктограммы = АдресаПиктограмм[Строка.ТипСсылки]; 
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПодсчитатьКоличествоКоммитов()
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		КоличествоКоммитов = 0;
		Возврат ;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Количество(1) как Количество
	|ИЗ
	|	Справочник.Изм_Коммиты КАК СправочникИзм_Коммиты
	|ГДЕ
	|	СправочникИзм_Коммиты.ТехническиеПроекты.ТехническийПроект = &ТехПроект";
	
	Запрос.УстановитьПараметр("ТехПроект", Объект.Ссылка);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	КоличествоКоммитов =  ТаблицаРезультата[0].Количество;
КонецПроцедуры

&НаСервере
Процедура ПодсчитатьКоличествоСвязей()
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		КоличествоСвязей = 0;
		Возврат ;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ Количество(1) как Количество
	|ИЗ
	|	РегистрСведений.Изм_СвязиПроектов КАК Изм_СвязиПроектов
	|ГДЕ
	|	Изм_СвязиПроектов.Источник = &ТехПроект
	|	ИЛИ Изм_СвязиПроектов.Приемник = &ТехПроект";
	
	Запрос.УстановитьПараметр("ТехПроект", Объект.Ссылка);
	
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	КоличествоСвязей =  ТаблицаРезультата[0].Количество;
	
КонецПроцедуры


&НаКлиенте
Процедура РедактированиеСсылкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, Результат);
		УстановитьПиктограммыСсылок();
		Модифицированность = Истина; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеСсылкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) = Тип("Структура") Тогда                   
		НоваяСтрока = Объект.Ссылки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Результат);
		УстановитьПиктограммыСсылок(); 
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьРодителяМетаданных()
	МассивМетаданных = Объект.ИзмененныеМетаданные.Выгрузить(, "ОбъектМетаданных").ВыгрузитьКолонку("ОбъектМетаданных");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИдентификаторыОбъектовМетаданных.Родитель КАК Родитель,
	|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка,
	|	ИдентификаторыОбъектовМетаданных.Родитель.Имя КАК РодительИмя
	
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|ГДЕ
	|	ИдентификаторыОбъектовМетаданных.Ссылка В(&Ссылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИдентификаторыОбъектовРасширений.Родитель,
	|	ИдентификаторыОбъектовРасширений.Ссылка,
	|	ИдентификаторыОбъектовРасширений.Родитель.Имя
	|ИЗ
	|	Справочник.ИдентификаторыОбъектовРасширений КАК ИдентификаторыОбъектовРасширений
	|ГДЕ
	|	ИдентификаторыОбъектовРасширений.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Ссылка", МассивМетаданных);
	
	Родители = Запрос.Выполнить().Выгрузить();
	Родители.Индексы.Добавить("Ссылка");
	
	Для каждого Строка Из Объект.ИзмененныеМетаданные Цикл      
		НайденнаяСтрока = Родители.Найти(Строка.ОбъектМетаданных, "Ссылка");
		Если НайденнаяСтрока = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Строка.Родитель = НайденнаяСтрока.Родитель; 
		Строка.Картинка = КартинкаМетаданных(НайденнаяСтрока.РодительИмя);
	КонецЦикла;
	Объект.ИзмененныеМетаданные.Сортировать("Родитель");
	
КонецПроцедуры

&НаСервере
Функция КартинкаМетаданных(ИмяОбъекта)
	Картинка = Неопределено;
	ШаблонИмениКартинки = "Метаданные%1";
	ИмяКартинки = СтрШаблон(ШаблонИмениКартинки, ИмяОбъекта);
	Попытка
		Возврат БиблиотекаКартинок[ИмяКартинки];
	Исключение
		Возврат Картинка;
	КонецПопытки;
КонецФункции // ()

&НаКлиенте
Процедура ДобавлениеСвязиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Связи.Обновить();
	ПодсчитатьКоличествоСвязей();
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьФайлСДанными()
	
	ФайлСДанными = ФайлыДляГрафа.ФайлСДанными;
	ИндексныйФайл = ФайлыДляГрафа.ИндексныйФайл;
	
	ОписаниеГрафа = ОписаниеГрафа();
	СодержимоеФайла = "const data = " + ОписаниеГрафа;
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	ТекстовыйФайл.УстановитьТекст(СодержимоеФайла);
	ТекстовыйФайл.Записать(ФайлСДанными);
	
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	ТекстовыйФайл.Прочитать(ИндексныйФайл);
	ТекстФайла = ТекстовыйФайл.ПолучитьТекст();
	ТекстФайла =  СтрЗаменить(ТекстФайла, "data.js", ФайлСДанными);
	ТекстовыйФайл.УстановитьТекст(ТекстФайла);
	ТекстовыйФайл.Записать(ИндексныйФайл);
	
КонецПроцедуры

&НаСервере
Функция ОписаниеГрафа()
	ПостроитьДеревоСвязей();
	ТаблицаСвязей = СвязиГрафа.Выгрузить();
	УзлыИсточники = ТаблицаСвязей.ВыгрузитьКолонку("Источник");
	УзлыИсточники = ОбщегоНазначенияКлиентСервер.СвернутьМассив(УзлыИсточники);
	УзлыПриемники = ТаблицаСвязей.ВыгрузитьКолонку("Приемник");
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УзлыИсточники, УзлыПриемники, Истина);
	ДанныеУзлов = ДанныеУзлов(УзлыИсточники);
	
	СтруктураДанных = НоваяСтруктураДанных();
	СтруктураДанных.Combos = ОписаниеГрупп(ДанныеУзлов);
	СтруктураДанных.Nodes = ОписаниеУзлов(ДанныеУзлов);
	СтруктураДанных.Edges = ОписаниеСвязей(ДанныеУзлов);
	
    Результат = ЗаписатьЗначениеJSON(СтруктураДанных);
    Возврат Результат;
КонецФункции

&НаСервере
Функция ОписаниеГрупп(ДанныеУзлов)
	Результат = Новый Массив;
	Отбор = Новый Структура("ЭтоГруппа", Истина);
	НайденныеСтроки = СвязиГрафа.НайтиСтроки(Отбор);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		Если ПроектУжеОписан(ДанныеУзлов, НайденнаяСтрока.Источник) Тогда
			Продолжить;
		КонецЕсли;
		ОписаниеГруппы = ОписаниеГруппы(ДанныеУзлов, НайденнаяСтрока.Источник);
		ДобавитьОписание(Результат, ОписаниеГруппы, ДанныеУзлов, НайденнаяСтрока.Источник);
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ОписаниеСвязей(ДанныеУзлов)
	Результат = Новый Массив;
	Отбор = Новый Структура("ЭтоГруппа", Ложь);
	НайденныеСтроки = СвязиГрафа.НайтиСтроки(Отбор);
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		ОписаниеСвязи = ОписаниеСвязи(ДанныеУзлов, НайденнаяСтрока);
		Результат.Добавить(ОписаниеСвязи);
	КонецЦикла;
	Возврат Результат;
КонецФункции


&НаСервере
Процедура ДобавитьОписание(Результат, Описание, ДанныеУзлов, Проект)
	Результат.Добавить(Описание);
	СтрокаСДанными = ДанныеУзлов.Найти(Проект, "Ссылка");
	СтрокаСДанными.УжеДобавлен = Истина;
КонецПроцедуры

&НаСервере
Функция ПроектУжеОписан(ДанныеУзлов, Проект)
	ОтборУзлов = Новый Структура("УжеДобавлен, Ссылка", Истина, Проект);
	Возврат ДанныеУзлов.НайтиСтроки(ОтборУзлов).Количество() > 0;
КонецФункции		

&НаСервере
Функция ОписаниеУзлов(ДанныеУзлов)
	Результат = Новый Массив;
	ОтборГрупп = Новый Структура("ЭтоГруппа", Истина);
	НайденныеСтроки = СвязиГрафа.НайтиСтроки(ОтборГрупп);
	Группы = Новый Соответствие;
	Для каждого строка Из НайденныеСтроки Цикл
		Группы.Вставить(Строка.Источник, Истина);
	КонецЦикла;
	
	Для Каждого Строка Из СвязиГрафа Цикл
		Если Группы[Строка.Источник] = Неопределено 
			И НЕ ПроектУжеОписан(ДанныеУзлов, Строка.Источник) Тогда
				ОписаниеУзла = ОписаниеУзла(ДанныеУзлов, Строка.Источник);
				ДобавитьОписание(Результат, ОписаниеУзла, ДанныеУзлов, Строка.Источник);
		КонецЕсли;
		Если Группы[Строка.Приемник] = Неопределено 
			И НЕ ПроектУжеОписан(ДанныеУзлов, Строка.Приемник) Тогда
				ОписаниеУзла = ОписаниеУзла(ДанныеУзлов, Строка.Приемник);
				ДобавитьОписание(Результат, ОписаниеУзла, ДанныеУзлов, Строка.Приемник);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаСервере
Функция ОписаниеГруппы(ДанныеУзлов, Проект)
	СтрокаСДанными = ДанныеУзлов.Найти(Проект, "Ссылка");
	ОписаниеГруппы = Новый Структура;
	ОписаниеГруппы.Вставить("id", Строка(СтрокаСДанными.УникальныйИдентификатор));
	ОписаниеГруппы.Вставить("type", "rect");
	ОписаниеГруппы.Вставить("label", СтрокаСДанными.Наименование);
	РодительПроекта = РодительПроекта(ДанныеУзлов, Проект);
	Если РодительПроекта <> Неопределено Тогда
		ОписаниеГруппы.Вставить("parentId", РодительПроекта);
	КонецЕсли;
	
	Возврат ОписаниеГруппы;
КонецФункции

&НаСервере
Функция ОписаниеСвязи(ДанныеУзлов, СтрокаСвязи)
	СтрокаСДаннымиИсточник = ДанныеУзлов.Найти(СтрокаСвязи.Источник, "Ссылка");
	СтрокаСДаннымиПриемник = ДанныеУзлов.Найти(СтрокаСвязи.Приемник, "Ссылка");
	ОписаниеСвязи = Новый Структура;
	ОписаниеСвязи.Вставить("source", Строка(СтрокаСДаннымиИсточник.УникальныйИдентификатор));
	ОписаниеСвязи.Вставить("target", Строка(СтрокаСДаннымиПриемник.УникальныйИдентификатор));
	Если ЗначениеЗаполнено(СтрокаСвязи.Пояснение) Тогда
		ОписаниеСвязи.Вставить("label", СтрокаСвязи.Пояснение);
	КонецЕсли;
	
	Возврат ОписаниеСвязи;
КонецФункции

&НаСервере
Функция РодительПроекта(ДанныеУзлов, Проект)
	Отбор = Новый Структура("ЭтоГруппа, Приемник", Истина, Проект);
	НайденныеСтроки = СвязиГрафа.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;	
	СтрокаСДанными = ДанныеУзлов.Найти(НайденныеСтроки[0].Источник, "Ссылка");
	Возврат Строка(СтрокаСДанными.УникальныйИдентификатор);
КонецФункции

&НаСервере
Функция ОписаниеУзла(ДанныеУзлов, Проект)
	СтрокаСДанными = ДанныеУзлов.Найти(Проект, "Ссылка");
	ОписаниеУзла = Новый Структура;
	ОписаниеУзла.Вставить("id", Строка(СтрокаСДанными.УникальныйИдентификатор));
	ОписаниеУзла.Вставить("type", "rect");
	ОписаниеУзла.Вставить("label", СтрокаСДанными.Наименование);
	ОписаниеУзла.Вставить("size", РазмерУзла(СтрокаСДанными));
	РодительПроекта = РодительПроекта(ДанныеУзлов, Проект);
	Если РодительПроекта <> Неопределено Тогда
		ОписаниеУзла.Вставить("comboId", РодительПроекта);
	КонецЕсли;
	Возврат ОписаниеУзла; 
КонецФункции

&НаСервере
Процедура ПостроитьДеревоСвязей()
	Потомки = Новый Массив;
	Потомки.Добавить(Объект.Ссылка);
	Пока Потомки.Количество() > 0 Цикл
		//@skip-check query-in-loop
		Потомки = ПотомкиТекущегоУровня(Потомки);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПотомкиТекущегоУровня(ТекущиеУзлы)
Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Изм_СвязиПроектов.Приемник КАК Источник,
		|	Изм_СвязиПроектов.Источник КАК Приемник,
		|	ИСТИНА КАК ЭтоГруппа,
		|	"""" КАК Пояснение
		|ПОМЕСТИТЬ втСвязи
		|ИЗ
		|	РегистрСведений.Изм_СвязиПроектов КАК Изм_СвязиПроектов
		|ГДЕ
		|	Изм_СвязиПроектов.Приемник В (&ТекущиеУзлы)
		|	И Изм_СвязиПроектов.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.Изм_ТипыСвязей.ВходитВСостав)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Изм_СвязиПроектов.Источник КАК Источник,
		|	Изм_СвязиПроектов.Приемник КАК Приемник,
		|	ИСТИНА КАК Поле1,
		|	"""" КАК Поле2
		|ИЗ
		|	РегистрСведений.Изм_СвязиПроектов КАК Изм_СвязиПроектов
		|ГДЕ
		|	Изм_СвязиПроектов.Источник В (&ТекущиеУзлы)
		|	И Изм_СвязиПроектов.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.Изм_ТипыСвязей.Содержит)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Изм_СвязиПроектов.Источник КАК Источник,
		|	Изм_СвязиПроектов.Приемник КАК Приемник,
		|	ЛОЖЬ КАК Поле1,
		|	Изм_СвязиПроектов.Пояснение КАК Пояснение
		|ИЗ
		|	РегистрСведений.Изм_СвязиПроектов КАК Изм_СвязиПроектов
		|ГДЕ
		|	Изм_СвязиПроектов.Источник В (&ТекущиеУзлы)
		|	И Изм_СвязиПроектов.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.Изм_ТипыСвязей.Связан)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Изм_СвязиПроектов.Приемник КАК Приемник,
		|	Изм_СвязиПроектов.Источник КАК Источник,
		|	ЛОЖЬ КАК Поле1,
		|	Изм_СвязиПроектов.Пояснение КАК Пояснение
		|ИЗ
		|	РегистрСведений.Изм_СвязиПроектов КАК Изм_СвязиПроектов
		|ГДЕ
		|	Изм_СвязиПроектов.Приемник В (&ТекущиеУзлы)
		|	И Изм_СвязиПроектов.ТипСвязи = ЗНАЧЕНИЕ(Перечисление.Изм_ТипыСвязей.Связан)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втСвязи.Приемник КАК Ссылка
		|ПОМЕСТИТЬ втПотомки
		|ИЗ
		|	втСвязи КАК втСвязи
		|ГДЕ
		|	втСвязи.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("ТекущиеУзлы", ТекущиеУзлы);
	
	Результаты = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ВыборкаСвязи = Результаты[0].Выбрать();
	
	Пока ВыборкаСвязи.Следующий() Цикл
		НоваяСтрока = СвязиГрафа.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаСвязи);
	КонецЦикла;
	
	Результат = Результаты[1].Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат Результат;
КонецФункции


&НаСервере
Функция ДанныеУзлов(Ссылки)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Изм_ТехническиеПроекты.Наименование,
		|	Изм_ТехническиеПроекты.Код,
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Изм_ТехническиеПроекты.Ссылка) КАК УникальныйИдентификатор,
		|	Изм_ТехническиеПроекты.Ссылка,
		|   Ложь как УжеДобавлен
		|ИЗ
		|	Справочник.Изм_ТехническиеПроекты КАК Изм_ТехническиеПроекты
		|ГДЕ
		|	Изм_ТехническиеПроекты.Ссылка В (&Ссылки)";
	
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Индексы.Добавить("Ссылка");
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция НоваяСтруктураДанных()
	Результат = Новый Структура;
	Результат.Вставить("nodes", Новый Массив);	
	Результат.Вставить("combos", Новый Массив);
	Результат.Вставить("edges", Новый Массив);
	Возврат Результат;
КонецФункции


&НаСервере
Функция РазмерУзла(Данные)
	Наименование = Данные.Наименование;
	
	СтрокиНаименования = СтрРазделить(Наименование, Символы.ПС);
	НаибольшаяДлина = 0;
	Для Каждого Строка Из СтрокиНаименования Цикл
		ДлинаСтроки = СтрДлина(Строка);
		Если ДлинаСтроки > НаибольшаяДлина Тогда
			НаибольшаяДлина = ДлинаСтроки;
		КонецЕсли;
	КонецЦикла;

	ВысотаСтроки = 14;
	ШиринаСимвола = 6;

	Высота =  высотаСтроки * СтрокиНаименования.Количество();
	Ширина =  ШиринаСимвола * НаибольшаяДлина;

	Результат = Новый Массив;
	Результат.Добавить(Ширина);
	Результат.Добавить(Высота);	
	Возврат Результат;
КонецФункции



#КонецОбласти

