
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(НаборКонстант.изм_РасположениеЗапускаемогоФайлаGIT) Тогда
	     НаборКонстант.изм_РасположениеЗапускаемогоФайлаGIT = "git";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТестЗапускаGIT(Команда)
	ТестЗапускаGITНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестЗапускаGITНаСервере()
	Результат = РаботаСГИТ.КомандаГИТ("version");
	Сообщить("Версия GIT:" + Результат);
КонецПроцедуры

&НаСервере
Процедура РасположениеЗапускаемогоФайлаGITПриИзмененииНаСервере()
	Константы.изм_РасположениеЗапускаемогоФайлаGIT.Установить(НаборКонстант.изм_РасположениеЗапускаемогоФайлаGIT); 
КонецПроцедуры

&НаКлиенте
Процедура РасположениеЗапускаемогоФайлаGITПриИзменении(Элемент)
	РасположениеЗапускаемогоФайлаGITПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКаталогКакБезопасный(Команда)
	УстановитьКаталогКакБезопасныйНаСервере();
КонецПроцедуры

&НаСервере
Процедура УстановитьКаталогКакБезопасныйНаСервере()
	Каталог = Константы.Изм_ЛокальныйКаталогРепозиторияGIt.Получить(); 
	каталогВЛинукс = СтрЗаменить(Каталог,"\", "/");
	Команда = СтрШаблон("config --global --add safe.directory %1", каталогВЛинукс);  
	Результат = РаботаСГИТ.КомандаГИТ(Команда, Каталог);

КонецПроцедуры

&НаСервере
Процедура УбратьОграничениеНаКолВоФайловНаСервере()  
	Каталог = Константы.Изм_ЛокальныйКаталогРепозиторияGIt.Получить(); 
	Команда = СтрШаблон("config diff.renameLimit 999999");  
	Результат = РаботаСГИТ.КомандаГИТ(Команда, Каталог);
КонецПроцедуры

&НаКлиенте
Процедура УбратьОграничениеНаКолВоФайлов(Команда)
	УбратьОграничениеНаКолВоФайловНаСервере();
КонецПроцедуры
