
&НаКлиенте
Процедура Ок(Команда)  
	Если ПроверитьЗаполнение() = Ложь Тогда
		Возврат;
	КонецЕсли;
	Результат = Новый Структура;
	Результат.Вставить("АдресСсылки", АдресСсылки);
	Результат.Вставить("Описание", Описание);
	Результат.Вставить("ТипСсылки", ТипСсылки);
	ЭтотОбъект.Закрыть(Результат);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "АдресСсылки, Описание, ТипСсылки");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоССылке(Команда)    
	Если ЗначениеЗаполнено(АдресСсылки) Тогда
		ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(АдресСсылки);
	КонецЕсли;	
КонецПроцедуры
