
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	Если Параметры.Свойство("Ссылка") = Ложь Тогда
		Возврат;
	КонецЕсли;
	ИдентификаторМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Параметры.Ссылка));
	СписокТехническихПроектов.Параметры.УстановитьЗначениеПараметра("ОбъектМетаданных", ИдентификаторМетаданных);
	СписокКоммитов.Параметры.УстановитьЗначениеПараметра("ОбъектМетаданных", ИдентификаторМетаданных);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторМетаданныхПриИзменении(Элемент)
	СписокТехническихПроектов.Параметры.УстановитьЗначениеПараметра("ОбъектМетаданных", ИдентификаторМетаданных);
	СписокКоммитов.Параметры.УстановитьЗначениеПараметра("ОбъектМетаданных", ИдентификаторМетаданных);
КонецПроцедуры
