
Процедура ПриЗаписи(Отказ)
	ОтразитьМетаданныеВПодсистемах();
КонецПроцедуры


Процедура ОтразитьМетаданныеВПодсистемах()
	Для каждого СтрокаТехПроекта Из ТехническиеПроекты Цикл
		СпрПроект = СтрокаТехПроекта.ТехническийПроект.ПолучитьОбъект();
		Для каждого СтрокаМетаданных  Из ИзмененныеМетаданные Цикл
			Отбор = Новый Структура("ОбъектМетаданных", СтрокаМетаданных.ОбъектМетаданных);
			НайденныеСтроки = СпрПроект.ИзмененныеМетаданные.НайтиСтроки(Отбор);	
			Если НайденныеСтроки.Количество() > 0 Тогда
				Продолжить;
			КонецЕсли;
			НоваяСтрока = СпрПроект.ИзмененныеМетаданные.Добавить();
			НоваяСтрока.ОбъектМетаданных = СтрокаМетаданных.ОбъектМетаданных;
		КонецЦикла;
		СпрПроект.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ЕстьСвязьСТехПроектами = ТехническиеПроекты.Количество() > 0;
КонецПроцедуры
