
#Область ПрограммныйИнтерфейс


// Новые файлы.
// 
// Параметры:
//  УникальныйИдентификатор - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  Неопределено, Соответствие - Новые файлы
Функция НовыеФайлы(УникальныйИдентификатор) Экспорт
	КаталогУстановленнойБиблиотеки = КаталогУстановленнойБиблиотеки();
	УстановитьБиблиотекуЕслиОтсутствует(КаталогУстановленнойБиблиотеки);
	
	Результат = Новый Структура;
	
	ШаблонНовогоИмени = "%1%2index%3.html";
	НовыйФайл = КопияФайла(ШаблонНовогоИмени, КаталогУстановленнойБиблиотеки, УникальныйИдентификатор);
	Результат.Вставить("ИндексныйФайл", НовыйФайл);
	
	ШаблонНовогоИмени = "%1%2data%3.js";
	НовыйФайл = КопияФайла(ШаблонНовогоИмени, КаталогУстановленнойБиблиотеки, УникальныйИдентификатор);
	Результат.Вставить("ФайлСДанными", НовыйФайл);
	
	Возврат Результат;	

КонецФункции

Процедура УдалитьСлужебныеФайлы(УникальныйИдентификатор) Экспорт
	КаталогУстановленнойБиблиотеки = КаталогУстановленнойБиблиотеки();
	УдалитьФайлы(КаталогУстановленнойБиблиотеки, "*" + УникальныйИдентификатор + ".*");
КонецПроцедуры

Процедура УдалитьВсеСлужебныеФайлы() Экспорт
	КаталогУстановленнойБиблиотеки = КаталогУстановленнойБиблиотеки();
	УдалитьФайлы(КаталогУстановленнойБиблиотеки, "*index_*.*");
	УдалитьФайлы(КаталогУстановленнойБиблиотеки, "*data_*.*");
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция КопияФайла(ШаблонИсходногоИмени, КаталогУстановленнойБиблиотеки, УникальныйИдентификатор)
	Разделитель = ПолучитьРазделительПути();
	ИсходныйФайл = СтрШаблон(ШаблонИсходногоИмени, КаталогУстановленнойБиблиотеки, Разделитель, "");
	Хвост = "_" + УникальныйИдентификатор;
	НовыйФайл = СтрШаблон(ШаблонИсходногоИмени, КаталогУстановленнойБиблиотеки, Разделитель, Хвост);
	КопироватьФайл(ИсходныйФайл, НовыйФайл);
	Возврат НовыйФайл;
КонецФункции

Функция КаталогУстановленнойБиблиотеки()
	КаталогВременныхФайлов = КаталогВременныхФайлов();	
	КаталогБиблиотеки = КаталогВременныхФайлов + "G6_" + ВерсияБиблиотеки() + ПолучитьРазделительПути();
	Возврат КаталогБиблиотеки;
КонецФункции

Процедура УстановитьБиблиотекуЕслиОтсутствует(КаталогБиблиотеки)
	СоздатьКаталог(КаталогБиблиотеки);
	ФайлНаДиске = Новый Файл(КаталогБиблиотеки);
	Существует = ФайлНаДиске.Существует();
	Если Существует = Ложь Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось создать каталог для библиотеки  G6 " + КаталогБиблиотеки);
	КонецЕсли;	
	
	ФайлНаДиске = Новый Файл(КаталогБиблиотеки + "index.html");
	Существует = ФайлНаДиске.Существует();
	
	Если Существует = Ложь Тогда
		ИзвлечьИсходники(КаталогБиблиотеки);
	КонецЕсли;
КонецПроцедуры

Функция ВерсияБиблиотеки()
	Возврат "4.8";
КонецФункции


Процедура ИзвлечьИсходники(КаталогБиблиотеки)
	УдалитьФайлы(КаталогБиблиотеки, "*.*");  
	ИмяФайла = КаталогБиблиотеки + "G6.zip";
	АдресМакета = Изм_БиблиотекаG6ВызовСервера.АдресМакета();
	ДанныеМакета = ПолучитьИзВременногоХранилища(АдресМакета);
	ДанныеМакета.Записать(ИмяФайла);   
	Попытка
		Файл = Новый ЧтениеZipФайла(ИмяФайла);
		Файл.ИзвлечьВсе(КаталогБиблиотеки);
		УдалитьФайлы(ИмяФайла);
	Исключение
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не удалось извлечь исходники G6" + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры


#КонецОбласти
