#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВыбора();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипСвязиПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УправлениеВидимостью()
	Элементы.Пояснение.Видимость = 
		Запись.ТипСвязи = ПредопределенноеЗначение("Перечисление.Изм_ТипыСвязей.Связан");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбора()
	ТипыСвязей = Перечисления.Изм_ТипыСвязей;
	Элементы.ТипСвязи.СписокВыбора.Добавить(ТипыСвязей.Связан, , ,
		 БиблиотекаКартинок.Изм_ПиктограммаПростаяСвязь);
	Элементы.ТипСвязи.СписокВыбора.Добавить(ТипыСвязей.Содержит, , , 
		БиблиотекаКартинок.Изм_ПиктограммаСостоитИз);
	Элементы.ТипСвязи.СписокВыбора.Добавить(ТипыСвязей.ВходитВСостав, , , 
		БиблиотекаКартинок.Изм_ПиктограммаВходитВСостав);
КонецПроцедуры
#КонецОбласти
