
&После("ПриОпределенииВидовПодключаемыхКоманд")
Процедура Изм_ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд)
	 Вид = ВидыПодключаемыхКоманд.Добавить();
	 Вид.Имя         = "ИзмененияВКонфигурации";
	 Вид.ИмяПодменю  = "ИзмененияВКонфигурации";
	 Вид.Заголовок   = НСтр("ru = 'Изменения в конфигурации'");
	 Вид.Картинка    = БиблиотекаКартинок.Изм_Git;
	 Вид.Отображение = ОтображениеКнопки.КартинкаИТекст; 

КонецПроцедуры

&После("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура Изм_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды)
	
	ДобавитьКоманду(Команды,
	"ИзмененияВКонфигурации",
	"Просмотр изменений",
	"Изм_ПодключаемыеКомандыКлиент.ОткрытьСписокТехПроектовСОтборомПоМетаданным",
	,
	Истина);	
	
КонецПроцедуры


Процедура ДобавитьКоманду(Команды, ИдентификаторПодменю, Представление, Обработчик, Порядок = 75, 
							ТолькоВоВсехДействиях = Ложь, ДополнительныеСвойства = Неопределено)
	
	НоваяКоманда = Команды.Добавить();
	НоваяКоманда.Порядок = Порядок;
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Вид = ИдентификаторПодменю;
	НоваяКоманда.МножественныйВыбор = Ложь;
	НоваяКоманда.РежимЗаписи = "НеЗаписывать";
	НоваяКоманда.ИзменяетВыбранныеОбъекты = Ложь;
	НоваяКоманда.Обработчик = Обработчик;
	НоваяКоманда.ТолькоВоВсехДействиях = ТолькоВоВсехДействиях;
	
	Если ДополнительныеСвойства <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(НоваяКоманда, ДополнительныеСвойства);
	КонецЕсли;
	
КонецПроцедуры
