
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	Если Параметры.Свойство("Ссылка") = Ложь Тогда
		Возврат;
	КонецЕсли;
	УстановитьПараметрыСписков();
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	ЭлементОформления = СписокКоммитов.УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЕстьСвязьСТехПроектами"); 
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; // либо задаем свой
	ЭлементОтбора.ПравоеЗначение  = Ложь; // либо задаем свой
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноСерый);
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСписков()
	ИдентификаторМетаданных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипЗнч(Параметры.Ссылка));
	СписокТехническихПроектов.Параметры.УстановитьЗначениеПараметра("ОбъектМетаданных", ИдентификаторМетаданных);
	СписокКоммитов.Параметры.УстановитьЗначениеПараметра("ОбъектМетаданных", ИдентификаторМетаданных);
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторМетаданныхПриИзменении(Элемент)
	СписокТехническихПроектов.Параметры.УстановитьЗначениеПараметра("ОбъектМетаданных", ИдентификаторМетаданных);
	СписокКоммитов.Параметры.УстановитьЗначениеПараметра("ОбъектМетаданных", ИдентификаторМетаданных);
КонецПроцедуры
